[
	{
		"id": 1,
		"name": "Prakriti Koirala",
		"description": "Prakriti Koirala holds a master's degree in Environmental Science with a specialization in climate change. She began her journey as an activist in 2016, driven by a passion for environmental and social justice. Actively engaged in research-based advocacy, Prakriti has been involved in international climate change negotiations since 2021, focusing on loss and damage as a negotiator from Nepal. She also serves as the global youth coordinator for the Least Developed Countries Group. Prakriti is a member of Loss and Damage Youth Coalition that is a coalition of youths from the global North and South to demand action on addressing the Loss and Damage caused by climate change. In addition to her advocacy work, Prakriti is the director of 'Clim Adapt,' a non-profit organization dedicated to building climate-resilient communities.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "prakriti054@gmail.com",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/prakriti.koirala.7",
			"linkedin": "https://www.linkedin.com/in/prakritikoirala",
			"instagram": "https://www.instagram.com/prakritikoirala__/"
		},
		"website": "https://prakritidotlive.wordpress.com/",
		"tags": [
			"Loss and Damage",
			"Global Stocktake",
			"Nationally Determined Contributions",
			"Youth Engagement",
			"Gender and Climate Change"
		],
		"logoUrl": "https://i.ibb.co/SQfDYVk/prakriti-koirala-logo.jpg",
		"pictures": ["https://i.ibb.co/SQfDYVk/prakriti-koirala-logo.jpg"],
		"slug": "prakriti-koirala"
	},
	{
		"id": 2,
		"name": "Abhishek Shrestha",
		"description": "Abhishek Shrestha is a Co-founder of Digo Bikas Institute and leads Climate justice Program at Institute. He is a Chevening Scholar who graduated in Masters in Climate Change and policy from the University of Sussex,  UK in 2013 and BSc. Environmental Science from Kathmandu University in 2008. <br> He received the  “Climate Change Award” in 2017 from the Government of Nepal for his work on Climate Change Policy and Advocacy. He has decade-long experience working as an activist, researcher, campaigner, policy analyst, and strategic communicator at a national and international level on climate change and environmental governance. He has been awarded  “JWH Initiative Environment leadership Award 2017. <br> He follows UN Climate Negotiation closely and has been participating since 2009, COP 15, and attended 8 COP meetings until COP 25 as a Youth representative, CSO representative, and Government delegation. He has been  working with diverse national and international climate justice groups since 2008. He has worked as Contributing Author for Government of Nepal publication on “ Key Issues for Nepal at different UN Climate Conference meetings and member of Government delegation at UN Climate Conference in Bonn 2017 (COP 23). <br> Abhishek has travelled to over 20 countries in Asia, Europe, Africa, South America, and North America and was invited to speak at different national and international conferences on the issue of climate change, climate activism, community solutions, and movement building. He was elected to Serve as YOUNGO Focal Point from Global South for 2012-2013 and interim focal point in COP-17, Durban (YOUNGO- Youth constituency at UNFCCC to ensure positive and constructive participation of the international youth in the UNFCCC) and is a British Council International Climate Champion 2010. He is the Coordinator of Nepal Environment Society- Province 1 and General Secretary of Chevening Alumni Association Nepal. He follows international and Nepal Cricket Closely.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "abhishek.shrestha@digobikas.org",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/avi77np",
			"linkedin": "https://np.linkedin.com/in/avi77",
			"instagram": "#"
		},
		"website": "https://digobikas.org/",
		"tags": [
			"Loss and Damage",
			"Climate Justice Activism",
			"Community Resilience",
			"Policy Advocacy",
			"Climate Negotiation"
		],
		"logoUrl": "https://i.ibb.co/VDmdhBh/abhishek-shrestha-logo.jpg",
		"pictures": ["https://i.ibb.co/ZhhdLWW/abhishek-shrestha-profile.jpg"],
		"slug": "abhishek-shrestha"
	},
	{
		"id": 2,
		"name": "Manjeet Dhakal",
		"description": "Manjeet is Head of LDC Support Team at Climate Analytics (CA) and Director for Climate Analytics South Asia office. He provides technical inputs and analysis to the Chair and members of the LDC Group, and coordinates the support provided by Climate Analytics to the group. He also leads the CA team at the regional office in South Asia. <br> Manjeet also serves as an Advisor to the Chair of the Least Developed Countries (LDC) Group at the multilateral process of the UNFCCC. In this role, he has worked with Nepal, Angola, Democratic Republic of Congo, Ethiopia, Bhutan and currently Senegal, and played a key part of the LDC efforts that led to the Paris Agreement in 2015. He has provided high-level climate leadership support for the LDCs’ officials and ministers in climate change UN-related processes over many years and is responsible for institutional capacity on climate issues. He has been following and participating in the UNFCCC negotiations for more than a decade. <br> Manjeet was honored in 2009 as ‘International Climate Champion’ by the British Council. He is also associated with School of Environmental Science and Management, Pokhara University in Nepal as an Adjunct Faculty for climate change. <br> Before joining Climate Analytics, Manjeet was Program Director at Clean Energy Nepal (CEN) where he worked for about five years and also served as the functional head of the organisation from June 2011 to April 2013. He remains active on the Board of CEN. He holds a Masters degree in Environmental Management (MSc) from Pokhara University, Kathmandu. He regularly writes, teaches and presents on climate change related issues.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "manjeet.dhakal@climateanalytics.org",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/manjeet.dhakal1",
			"linkedin": "https://np.linkedin.com/in/manjeetdhakal",
			"instagram": "https://www.instagram.com/manjeetdhakal/"
		},
		"website": "https://climateanalytics.org/team/manjeet-dhakal",
		"tags": [
			"Policy Advocacy",
			"Climate Education",
			"Community Resilience",
			"Climate Diplomacy & Negotiation",
			"Climate Justice Activism"
		],
		"logoUrl": "https://i.ibb.co/3vQ2n1m/manjeet-dhakal-logo-new.jpg",
		"pictures": ["https://i.ibb.co/d5qdYDc/manjeet-dhakal-profile.jpg"],
		"slug": "manjeet-dhakal"
	},
	{
		"id": 2,
		"name": "Rajan Thapa",
		"description": "Rajan Thapa is an influential climate change professional and the national project manager for the GEF- CBIT project at the World Wildlife Fund (WWF) in Nepal. With over 14 years of experience in climate change and the environmental sector, he has significantly contributed to building community resilience and evidence-based policy advocacy. Mr. Thapa has a strong academic background in environmental science, which has helped shape his career. Since September 2016, he has also been a lecturer at the Department of Environmental Science at Patan Multiple Campus, teaching students about climate change, and sustainable development. <br> Before joining WWF, Rajan held several important positions. He worked as a Climate Action Advisor at Folkekirkens Nødhjælp (DanChurchAid) from June 2021 to April 2023, focusing on initiatives to build climate resilience. He also served as an M&E Coordinator at CISU - Civilsamfund I Udvikling, where he promoted community empowerment through better management of natural resources. Additionally, he was a climate change expert at Oxford Policy Management, where he developed methods and assessed climate change vulnerability risk and possible adaptation measures. <br> Mr. Thapa’s skills include project development, project management, policy analysis, and climate change negotiations. Besides actively engaging with the Government of Nepal in national climate discourse, he supports the government in international climate negotiation.  His work in climate change management has been crucial in advising on reporting national climate ambitions and action, climate finance, and aiding the government in executing its national climate policies, adaptation plans, and NDC. <br> Mr. Thapa has worked to strengthen the capacity of government and non-state actors, including  CSOs and youth and research institutions, and has advanced Nepal’s commitments to international climate agreements and sustainable development goals. As he continues his work at WWF, Rajan Thapa remains dedicated to supporting the government in reporting national climate change adaptation and mitigation efforts to UNFCCC and promoting effective climate action and sustainable practices that benefit the environment and local communities.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/rajan.thapa.562",
			"linkedin": "https://np.linkedin.com/in/rajan-thapa-87485a78",
			"instagram": ""
		},
		"website": "https://www.researchgate.net/profile/Rajan-Thapa-6",
		"tags": [
			"Research-based Policy Advocacy",
			"Youth Engagement",
			"Climate Justice Activism",
			"Transparency framework under Paris Agreement",
			"Climate Change Adaptation",
			"Climate Change Mitigation"
		],
		"logoUrl": "https://i.ibb.co/pZ8gKdk/rajan-thapa-logo-f.jpg",
		"pictures": ["https://i.ibb.co/QXTf1k7/rajan-thapa-profile.jpg"],
		"slug": "rajan-thapa"
	},
	{
		"id": 2,
		"name": "Raju Pandit Chettri",
		"description": "Raju Pandit Chhetri is a leading figure in Nepal's climate action and sustainable development efforts, with over 15 years of experience in the field. He currently serves as the Executive Director of the Prakriti Resources Centre (PRC), an organization based in Kathmandu that focuses on sustainable development and environmental justice in Nepal. <br> Chhetri has dedicated much of his career to working within international climate change policy frameworks, particularly under the United Nations Framework Convention on Climate Change (UNFCCC) and the Green Climate Fund (GCF). He has been actively involved in climate negotiations, representing the interests of the Least Developed Countries (LDC) Group, and has provided support to LDC Board Members of the GCF. His expertise in climate finance and policy advocacy has made him a respected voice in both national and international arenas. <br> In addition to his role at PRC, Raju is a member of the Climate Change Council for the Government of Nepal and serves on the Climate Finance Technical Committee within the Ministry of Finance. His contributions to climate policy development and implementation have been instrumental in advancing Nepal's commitments to climate action and sustainability.Throughout his career, Raju has worked with various organizations, including the United Mission to Nepal (UMN) and Climate Action Network International (CANI). His work is characterized by a strong commitment to community engagement, ensuring that local voices and needs are prioritized in climate strategies. <br> Raju Pandit Chhetri's efforts in the climate space have garnered recognition both nationally and internationally. He is known for inspiring a new generation of climate leaders in Nepal and fostering a collaborative approach to tackling the pressing challenges posed by climate change. His passion for sustainable development continues to drive his work, making a significant impact on the future of Nepal's environment and communities.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "raju@prc.org.np",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/rajupchhetri",
			"linkedin": "https://np.linkedin.com/in/raju-pandit-chhetri-58133a283",
			"instagram": ""
		},
		"website": "https://prc.org.np/",
		"tags": [
			"Policy Advocacy",
			"Climate Finance",
			"Community Resilience",
			"Climate Diplomacy & Negotiation",
			"Sustainable Development"
		],
		"logoUrl": "https://i.ibb.co/JrWtgXj/raju-pandit-chettri-logo.jpg",
		"pictures": ["https://i.ibb.co/mhKwSFV/raju-pandit-chettri-profile.jpg"],
		"slug": "raju-pandit-chettri"
	},
	{
		"id": 2,
		"name": "Preity Gurung",
		"description": "Preity Gurung is a researcher and activist dedicated to addressing climate change and its impact on indigenous communities in Nepal. She is currently a Program Officer at the Center for Indigenous Peoples' Research and Development (CIPRED) in Kathmandu. Her work focuses on recognizing Indigenous Peoples' knowledge, cultural values, and customary institutions that contribute to the sustainable management of forests, ecosystems, biodiversity, and climate resilience. <br> Ms. Gurung holds a Master's degree in Sustainable Development from Kathmandu University and has over a decade of experience in the development sector. She is actively engaged in youth networks that advance Indigenous Peoples' rights on both national and global scales. She has participated in various international platforms, including COP27 in Sharm El Sheikh, where she served as a knowledge holder at the LCIPP knowledge holders gathering. Additionally, she is a member of the International Indigenous Forum on Biodiversity (IIFB). <br> As a member of the Human Rights Working Group at YOUNGO, the official youth constituency to the UNFCCC, Ms. Gurung advocates for the inclusion of indigenous voices in global climate discussions. She emphasizes that indigenous communities, with their traditional ecological knowledge and sustainable practices, should be at the forefront of developing climate solutions. <br> As an indigenous woman herself, Ms. Gurung brings a unique intersectional perspective to her work, highlighting how factors like gender, disability, and ethnicity compound the vulnerabilities of certain groups to the impacts of climate change. She continues to be a vocal advocate for climate justice and the rights of indigenous peoples in Nepal and beyond.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "pgurung@cipred.org.np",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/preity.gurung.71",
			"linkedin": "https://np.linkedin.com/in/preity-gurung-7bb12981",
			"instagram": ""
		},
		"website": "https://www.cipred.org.np/team.php",
		"tags": [
			"Climate Justice Activism",
			"Indigenous Knowledge",
			"Community Resilience",
			"Intersectionality",
			"Sustainable Development"
		],
		"logoUrl": "https://i.ibb.co/KLMhm36/preity-gurung-logo.jpg",
		"pictures": ["https://i.ibb.co/3mPNWv8/preity-gurung-profile.jpg"],
		"slug": "preity-gurung"
	},
	{
		"id": 2,
		"name": "Ghanshyam Bhattarai",
		"description": "Ghanshyam Bhattarai is a passionate youth leader dedicated to creating a better world. After earning his Bachelor’s in Food Technology, he initiated a campaign that educated thousands of students in Nepal on food safety. For the past six years, he has focused on empowering youth to engage in sustainable agrifood systems and combat the climate crisis. <br> Currently, Ghanshyam works as the Strategy and Innovation Lead at the World Food Forum Nepal chapter, where he works closely with FAO Nepal to engage and empower youth in the food and agriculture sector through various capacity-building programs and learning opportunities. <br> Ghanshyam has been the Regional Coordinator for South Asia at the Thought For Food Foundation since 2022. He led the Redefining and Empowering Food Technologists (REFT 2020) hackathon, which addressed food security issues, and convened the UN Food Systems Summit 2021 Independent Dialogue, bringing together stakeholders from the entire food supply chain. His full reports can be accessed here (https://bit.ly/3mC8ZaB) and here (https://summitdialogues.org/dialogue/33727/). <br> Ghanshyam’s leadership extends to policy drafting and analysis, mentoring young innovators, and conducting workshops and events. He is an alumnus of FAO’s Food & Climate Shapers Bootcamp and UNICEF's Youth Engagement for Climate Action Program Fellowship. Last year, as a Focal Point, he organized the Local Conference of Youth (LCOY) 2023 in Nepal, further showcasing his commitment to youth empowerment and climate action. His ultimate goal is to contribute to the food sector and its sustainability with a global perspective and a local impact.",
		"address": "Kathmandu, Nepal",
		"contact": {
			"email": "ghanshyam.bhtr@gmail.com",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/ghanshyam.bhtr",
			"linkedin": "https://www.linkedin.com/in/ghanshyamb/",
			"instagram": "https://www.instagram.com/ghanshyam.bhtr"
		},
		"website": "https://medium.com/@ghanshyam.bhtr",
		"tags": [
			"Sustainable Food Systems",
			"Food Security & Climate Change",
			"Nutrition & Healthy Diets",
			"Youth Empowerment"
		],
		"logoUrl": "https://i.ibb.co/QMszgws/ghanshyam-bhattarai-logo-1.jpg",
		"pictures": ["https://i.ibb.co/LzkwrvV/ghanshyam-bhattarai-profile.jpg"],
		"slug": "ghanshyam-bhattarai"
	},
	{
		"id": 0,
		"name": "Sagar Koirala",
		"description": "Sagar Koirala is an influential youth leader and environmental advocate, known for his extensive involvement in various global initiatives aimed at fostering sustainable development, empowering young people, and promoting environmental conservation. His journey is marked by a series of significant roles across numerous organizations, each reflecting his commitment to making a positive impact on the world. <br> Currently, Sagar serves as the Regional Focal Point for the Asia Pacific at the Sendai Stakeholders Children and Youth Group. He is also a member of Young Water Professionals Nepal and the Groundwater Youth Network in Paris, contributing to innovative water management solutions. Sagar's mentorship extends to organizations like Wedu and the Asian Environmental Youth Network, empowering young individuals to drive social change. His roles with the International Republican Institute's Generation Democracy program and as a Student Energy Fellow underscore his commitment to democratic governance, civic participation, and sustainable energy solutions. Additionally, he has significantly contributed to food sustainability as a Youth Ambassador for Real Food Systems and as a member of the United Nations Major Group for Children and Youth since 2019. <br> Sagar's academic background in agriculture from Agriculture and Forestry University, Rampur, complements his professional endeavors. Currently, he is pursuing a Master in Agribusiness at Purbanchal University. His accolades, such as the Most Inspirational Ambassador of the 29th Eco-generation Regional Ambassador and the Hidden Eco Hero Award from UNEP, highlight his contributions to climate advocacy and environmental education.  Currently he is pursuing as Executive Board Member of the Nepal US Alumni Network(NUSAN) and previously served as Regional Youth Focal Point- Asia Pacific at the World Food Forum. His diverse roles reflect a deep commitment to fostering sustainable development, empowering the next generation, and addressing global challenges through collaborative and innovative approaches. Mr Koirala works in the intersection of climate, agriculture, DRR, youth engagement, governance, SDG and gender.",
		"address": "Itahari, Nepal",
		"contact": {
			"email": "koiralasagar400@gmail.com",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/profile.php?id=100010343144550",
			"linkedin": "https://www.linkedin.com/in/sagar-koirala-he-him-his-7a221a144",
			"instagram": "https://www.instagram.com/sagar_koirala17/"
		},
		"website": "https://www.researchgate.net/profile/Sagar-Koirala-2",
		"tags": [
			"Sustainable Food Systems",
			"Climate Justice Activism",
			"Environmental Education",
			"Climate Resilience",
			"Disaster Risk Reduction"
		],
		"logoUrl": "https://i.ibb.co/hVyDzvN/sagar-koirala-logo.jpg",
		"pictures": ["https://i.ibb.co/LxndtXj/sagar-koirala-profile.jpg"],
		"slug": "sagar-koirala"
	},
	{
		"id": 0,
		"name": "Prayash Adhikari",
		"description": "It was 2015 when I started my activism after the National Climate Convergence empowering and connecting me with climate activists and groups. After that, my team and I started a youth regional group in Lamjung (NYCA-Lamjung) where we focused on capacity building of youths, community empowerment, climate education, ground-based research, local government engagement, and stakeholder partnerships reaching thousands of youths and hundred of community and stakeholders making us able to decentralize climate education and activism from Kathmandu. <br> These experiences made me able to join a group of active, enthusiastic youths expanding our reach and actions on a National level working together at the international youth group i.e. CliMates Nepal. After a long experience in youth volunteerism and working on climate issues I worked closely with the community in rural Nepal focusing more on, food sovereignty and climate crisis prioritizing community education, community-led solutions, women empowerment, and value chain. <br> And now, I’ve rejoined the team with whom I started my journey i.e. Digo Bikas Institute where I am prioritizing youth engagement, research, advocacy, community approach, climate education, agroecology, loss and damage, and stakeholder collaboration as Senior Program Officer of Climate Justice Program. This opportunity has provided me with a comparative analysis of climate change narratives, solutions to the climate crisis, the importance of community-led adaptation strategies, their relevance, and the fight demanding climate justice from local, regional to global levels. Here we focus our programs on children and youths in line with the National Climate Change Policy with the GCV and CJSS program, support the community to implement agroecology as a real solution to the climate crisis, conduct research and actions from national to global level debunking the false narrative and false solution to the climate crisis.",
		"address": "Dhangadhi, Kailali, Nepal",
		"contact": {
			"email": "prayash.adhikari@digobikas.org",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/prayash.adhikari.56",
			"linkedin": "https://www.linkedin.com/in/prayash-adhikari-6b5082119/",
			"instagram": "https://www.instagram.com/prayash_adhikari63/"
		},
		"website": "https://digobikas.org/prayas-adhikari/",
		"tags": [
			"Climate Justice Activism",
			"Youth Engagement",
			"Loss and Damage",
			"Food sovereignty and climate justice (Agroecology)",
			"Community-led solutions to the climate crisis",
			"Research, advocacy and implementation"
		],
		"logoUrl": "https://i.ibb.co/SdQzfnp/prayash-adhikari-logo.jpg",
		"pictures": ["https://i.ibb.co/mRJQgRM/prayash-adhikari-profile.jpg"],
		"slug": "prayash-adhikari"
	},
	{
		"id": 0,
		"name": "Monica Neupane",
		"description": "Monica Neupane is a dynamic climate activist and environmental advocate from Nepal, renowned for her impactful work in climate education and sustainable development. With a background as a Program Officer at the Center for Environment Education Nepal, she has successfully integrated climate change learning into sustainable practices, training over 30 teachers and reaching over 2,500 students across more than 15 schools. <br> As the President of CliMates Nepal, Monica was a lead organizer for events such as the Climate Action Simulation and Nepal's first Local Conference of Youth (LCOY) in 2020. She has led numerous climate events and discussions, mobilizing thousands of youth for climate action. Honored with the Youth Award at the LOF National Conference in 2023, Monica's global engagements include representing Nepal at COP 27, where she contributed to international climate policy discussions. Her TEDx Kamalpokhari talk on climate anxiety and PTSD underscores her commitment to addressing the mental health impacts of climate change. <br> Currently, Monica is spearheading a sustainable startup focused on education and eco-friendly living, transforming spaces into green hubs. Her work emphasizes grassroots mobilization, youth empowerment, and integrating sustainability into daily life. Monica's mission is to inspire collective action for a sustainable future, advocating for a healthier planet and a brighter tomorrow.",
		"address": "Satdobato road, Lalitpur",
		"contact": {
			"email": "advocacymonica@gmail.com",
			"phone": ""
		},
		"socials": {
			"facebook": "https://www.facebook.com/monica.neupane.96/",
			"linkedin": "https://www.linkedin.com/in/monica-neupane-554658198/",
			"instagram": "https://www.instagram.com/minimalistic_life06/"
		},
		"website": "https://moniconeupane.wixsite.com/monico",
		"tags": [
			"Environmental Education",
			"Urban Sustainability",
			"Entrepreneurship",
			"Climate Policy Advocacy",
			"Biodiversity Conservation"
		],
		"logoUrl": "https://i.ibb.co/PNVG617/monica-neupane-logo.jpg",
		"pictures": ["https://i.ibb.co/TK5DG2t/monica-neupane-profile.jpg"],
		"slug": "monica-neupane"
	}
]
