[
  {
    "id": 0,
    "name": "Shreya K C",
    "description": "Hi! I am Shreya K.C., a passionate socio-climate justice activist from Nepal. I have worked with young people worldwide for meaningful youth involvement in decision-making and advocating for comprehensive climate education. Currently, I serve as the Advocacy Co-coordinator for the Loss and Damage Youth Coalition, leading campaigns and building youth capacity on climate-induced loss and damage. I also manage projects and develop campaigns on clean energy and climate change as a Policy Advisor at Clean Energy Nepal. Additionally, I engage with global and local youth networks as a Youth Advisor for The Iris Project and mentor prize winners. I also host a climate podcast called, ‘Digo Bahas’ to inspire laymen people to take action by sharing stories of hope and resilience. <br> I was recognized as a EE 30 Under 30, for making an incredible contribution in environmental education  by North American Association for Environmental Education (NAAEE), and I was the former Board Member at Clean Energy Nepal. I volunteered as a mentor for the NDC Project at Care About Climate and worked with YOUNGO as the Contact Point for the Nationally Determined Contributions Working Group for two years. My work also includes coordinating campaigns and mobilizing youths at Mock COP26 and I have represented Nepal as a Youth Delegate at COP25 till COP28. I am also recognized as a Youth Climate Change Champion for UNICEF South Asia, participated in various youth conferences, and worked on youth-led climate initiatives. My activism began with volunteering to serve as a Network Coordinator atNepalese Youth for Climate Action (NYCA), a leading youth led volunteering network in Nepal. I also taught science and environment at Himchuli English Higher Secondary School for two years. Throughout my career, I have been committed to driving meaningful climate action and empowering young people to lead the charge in climate justice. <br> My story has been featured in 'Stone Soup for a Sustainable World' and '50 Girls Saving Our Planet.' In 2022, I received the 'Youth of the Year' award for my climate action efforts. In my spare time, I love reading, traveling to natural places, and catching up on sleep.",
    "address": "Lalitpur, Nepal",
    "contact": {
      "email": "kcshreyaenv@gmail.com",
      "phone": ""
    },
    "socials": {
      "facebook": "https://x.com/KCShreya1",
      "linkedin": "https://np.linkedin.com/in/shreya-kc-climategirl",
      "instagram": "https://www.instagram.com/kcshreya1/"
    },
    "website": "https://kcshreya.wordpress.com/",
    "tags": [
      "Climate Justice Activism",
      "Climate Education",
      "Entrepreneurship",
      "Youth Engagement in Policy Making",
      "Loss and Damage"
    ],
    "logoUrl": "https://i.ibb.co/D4qT0LV/shreya-kc-logo.jpg",
    "pictures": ["https://i.ibb.co/n1H80Kk/shreya-kc-profile.jpg"],
    "slug": "shreya-kc"
  },
  {
    "id": 1,
    "name": "Preity Gurung",
    "description": "Preity Gurung is a researcher and activist dedicated to addressing climate change and its impact on indigenous communities in Nepal. She is currently a Program Officer at the Center for Indigenous Peoples' Research and Development (CIPRED) in Kathmandu. Her work focuses on recognizing Indigenous Peoples' knowledge, cultural values, and customary institutions that contribute to the sustainable management of forests, ecosystems, biodiversity, and climate resilience. <br> Ms. Gurung holds a Master's degree in Sustainable Development from Kathmandu University and has over a decade of experience in the development sector. She is actively engaged in youth networks that advance Indigenous Peoples' rights on both national and global scales. She has participated in various international platforms, including COP27 in Sharm El Sheikh, where she served as a knowledge holder at the LCIPP knowledge holders gathering. Additionally, she is a member of the International Indigenous Forum on Biodiversity (IIFB). <br> As a member of the Human Rights Working Group at YOUNGO, the official youth constituency to the UNFCCC, Ms. Gurung advocates for the inclusion of indigenous voices in global climate discussions. She emphasizes that indigenous communities, with their traditional ecological knowledge and sustainable practices, should be at the forefront of developing climate solutions. <br> As an indigenous woman herself, Ms. Gurung brings a unique intersectional perspective to her work, highlighting how factors like gender, disability, and ethnicity compound the vulnerabilities of certain groups to the impacts of climate change. She continues to be a vocal advocate for climate justice and the rights of indigenous peoples in Nepal and beyond.",
    "address": "Kathmandu, Nepal",
    "contact": {
      "email": "pgurung@cipred.org.np",
      "phone": ""
    },
    "socials": {
      "facebook": "https://www.facebook.com/preity.gurung.71",
      "linkedin": "https://np.linkedin.com/in/preity-gurung-7bb12981",
      "instagram": ""
    },
    "website": "https://www.cipred.org.np/team.php",
    "tags": [
      "Climate Justice Activism",
      "Indigenous Knowledge",
      "Community Resilience",
      "Intersectionality",
      "Sustainable Development"
    ],
    "logoUrl": "https://i.ibb.co/KLMhm36/preity-gurung-logo.jpg",
    "pictures": ["https://i.ibb.co/3mPNWv8/preity-gurung-profile.jpg"],
    "slug": "preity-gurung"
  },
  {
    "id": 2,
    "name": "Prakriti Koirala",
    "description": "Prakriti Koirala holds a master's degree in Environmental Science with a specialization in climate change. She began her journey as an activist in 2016, driven by a passion for environmental and social justice. Actively engaged in research-based advocacy, Prakriti has been involved in international climate change negotiations since 2021, focusing on loss and damage as a negotiator from Nepal. She also serves as the global youth coordinator for the Least Developed Countries Group. Prakriti is a member of Loss and Damage Youth Coalition that is a coalition of youths from the global North and South to demand action on addressing the Loss and Damage caused by climate change. In addition to her advocacy work, Prakriti is the director of 'Clim Adapt,' a non-profit organization dedicated to building climate-resilient communities.",
    "address": "Kathmandu, Nepal",
    "contact": {
      "email": "prakriti054@gmail.com",
      "phone": ""
    },
    "socials": {
      "facebook": "https://www.facebook.com/prakriti.koirala.7",
      "linkedin": "https://www.linkedin.com/in/prakritikoirala",
      "instagram": "https://www.instagram.com/prakritikoirala__/"
    },
    "website": "https://prakritidotlive.wordpress.com/",
    "tags": [
      "Loss and Damage",
      "Global Stocktake",
      "Nationally Determined Contributions",
      "Youth Engagement",
      "Gender and Climate Change"
    ],
    "logoUrl": "https://i.ibb.co/SQfDYVk/prakriti-koirala-logo.jpg",
    "pictures": ["https://i.ibb.co/SQfDYVk/prakriti-koirala-logo.jpg"],
    "slug": "prakriti-koirala"
  },
  {
    "id": 3,
    "name": "Tashi Lhazom",
    "description": "Tashi Lhazom is a prominent youth climate advocate working at the intersection of climate action, gender equality, indigenous rights, and political and climate literacy. She has spoken at grassroots, national, and global platforms, and is a co-founder of two civil society initiatives. With the wide range of hats that Tashi wears, she is also a filmmaker that harnesses the power of storytelling to promote generational change in delivering climate justice. \"No Monastery, No Village\" is her directorial debut based on the nexus of climate change and cultural heritage of indigenous people. As an academician, she covers climate diplomacy and politics. She holds an undergraduate degree from Hindu College, University of Delhi. She specializes in Climate Politics.",
    "address": "Kathmandu, Nepal",
    "contact": {
      "email": "lhazomtashi17@gmail.com",
      "phone": ""
    },
    "socials": {
      "facebook": "https://www.facebook.com/tashi.lhazom.9",
      "linkedin": "https://in.linkedin.com/in/tashi-lhazom-5a433b22b",
      "instagram": "https://www.instagram.com/hashtag_tashi//"
    },
    "website": "",
    "tags": [
      "Climate Justice Activism",
      "Climate Policy Reform",
      "Sustainable Development",
      "Youth Engagement",
      "Climate Education"
    ],
    "logoUrl": "https://i.ibb.co/KWSF0Ph/tashi-lhazom-logo.jpg",
    "pictures": ["https://i.ibb.co/fYLsjQx/thasi-lhazom-profile.jpg"],
    "slug": "thasi-lhazom"
  }
]
