[
  {
    "title": "Discussions on Pathways to Fossil Fuel Free Nepal By 2045",
    "organizer": "Digo Bikas Institute",
    "description": "The event, organized by Digo Bikas Institute, was held on 4th February. Abhishek Shrestha shared insights on fossil fuel usage, oil drilling, and pipelines in Nepal. A panel discussion followed, focusing on achieving a fossil fuel-free Nepal and transitioning to 100% renewable energy, with speakers Dr. Prof. Sangeeta Singh (Institute of Engineering), Mr. Kushal Gurung (RECON), Ms. Subha Laxmi Shrestha (AEPC), and Mr. Dilli Ghimire (Nepal Energy Foundation). The event concluded with a group discussion on reducing fossil fuel dependency and promoting an equitable energy transition.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Panel Discussion",
    "format": "In-person",
    "startDate": "2025-02-04",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@digobikas.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://digobikas.org/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate Justice",
      "Renewable Energy",
      "Climate Activism & Advocacy"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/digobikasinstitute/",
      "instagram": null,
      "linkedin": null
    },
    "id": 1
  },
  {
    "title": "Sagarmatha Sambad",
    "organizer": "Government of Nepal",
    "description": "Sagarmatha Sambaad was a multi-stakeholder global dialogue held in Kathmandu from 16 to 18 May 2025, organized by the Government of Nepal. The forum focused on  Climate Change, Mountains and the Future of Humanity and brought together participants from diverse backgrounds to deliberate on critical global, regional, and national challenges. Named after Mt. Sagarmatha (Everest), a symbol of unity and resilience, the event aimed to foster open, inclusive, and collaborative discussions for promoting collective well-being. Rooted in the Himalayan tradition of reflection and dialogue, the Sambaad served as a platform to exchange ideas, inspire solutions, and strengthen global cooperation.",
    "location": "Soaltee Hotel, Kathmandu",
    "locationType": "National",
    "type": "Summit",
    "format": "Hybrid",
    "startDate": "2025-05-16",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "secretariat@sagarmathasambaad.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://sagarmathasambaad.org/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate Adaptation & Mitigation",
      "Community Resilience",
      "Ecosystem Conservation"
    ],
    "address": {
      "street": null,
      "city": "Soaltee Hotel",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/sagarmatha.sambaad/",
      "instagram": null,
      "linkedin": null
    },
    "id": 2
  },
  {
    "title": "International Expert Dialogue on Mountains, People and Climate",
    "organizer": "Government of Nepal",
    "description": "The Ministry of Forests and Environment organized a two-day international expert dialogue on \"Mountains, People, and Climate\" in Kathmandu. Over two hundred participants, including government ministers, climate scientists, researchers, and other global stakeholders, convened to demonstrate solidarity and commitment to global climate action. Highlighting the urgency, Nepal called upon the international community to address the climate change repercussions on the Himalayas and downstream areas.",
    "location": "Chandragiri Hill Resort, Kathmandu",
    "locationType": "National",
    "type": "Conference",
    "format": "Hybrid",
    "startDate": "2024-05-22",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "mountaindialoguenepal@gmail.com",
    "status": "Closed",
    "cost": "Free",
    "website": "https://mountain.mofe.gov.np/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Ecosystem Conservation",
      "Community Resilience",
      "Climate Justice"
    ],
    "address": {
      "street": null,
      "city": "Chandragiri Hill Resort",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/moefcc/",
      "instagram": null,
      "linkedin": null
    },
    "id": 3
  },
  {
    "title": "Global Day of Action",
    "organizer": "Digo Bikas Institute",
    "description": "In solidarity and demanding Equitable Climate finance for the people and communities, Global Day of Action for Climate Justice was organized across 16 different cities of Nepal. Actions were coordinated by People's Climate Mobilization which was jointly by farmers, trade unions, youth, activists, and CSOs. ",
    "location": "16 different cities across Nepal including Kathmandu, Hetauda, Lamjung, Surkhet, Nepalgunj, Jhapa, Dhangadi, Butwal and more. ",
    "locationType": "National",
    "type": "March",
    "format": "In-person",
    "startDate": "2024-11-16",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@digobikas.org",
    "status": "Closed",
    "cost": "Free",
    "website": "digobikas.org",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate Finance",
      "Climate Activism & Advocacy",
      "Loss & Damage"
    ],
    "address": {
      "street": null,
      "city": "16 different cities across Nepal including Kathmandu",
      "state": "All 7 provinces",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/digobikasinstitute/",
      "instagram": null,
      "linkedin": null
    },
    "id": 4
  },
  {
    "title": "People's Climate March 2024",
    "organizer": "Digo Bikas Institute",
    "description": "People's Climate March was organized in September across 9 different cities of Nepal with the participation of youths, civil society organizations, farmer groups, women's group, disabled group, marginalized and indigenous groups, demanding to pay up for climate finance. The activists stated that the global north owes $5 trillion annually to the global south, and it is their moral and legal obligation as climate debt. ",
    "location": "across 9 cities of Nepal (Pokhara, Hetauda, Kathmandu, Biratnagar and more)",
    "locationType": "National",
    "type": "March",
    "format": "In-person",
    "startDate": "2024-09-16",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@digobikas.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://digobikas.org",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": ["Climate Activism & Advocacy", "Climate Justice"],
    "address": {
      "street": null,
      "city": "across 9 cities of Nepal (Pokhara",
      "state": "All 7 provinces",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/digobikasinstitute/",
      "instagram": null,
      "linkedin": null
    },
    "id": 5
  },
  {
    "title": "Waste Management and Climate Conference 2024",
    "organizer": "Nepal Government, Khaalisisi, Confederation of Nepalese Industries, National Human Rights Commission, and Coca Cola Foundation and co-organized by WHR and CNIYEF.",
    "description": "The Waste Management and Climate Conference (WMCC) brought together nearly 1,000 delegates from 600 organizations across 33 districts and five countries. The event focused on innovative solutions for transforming waste into resources and promoting a circular economy. Discussions addressed carbon emissions, plastic and air pollution, and climate change impacts on the Himalayas, including Mt. Everest. Presentations featured initiatives from GIZ and highlighted Nepal's climate commitments under the Paris Agreement. The conference served as a national platform for government officials, diplomats, and industry experts to collaborate and advance policy dialogue on waste management and climate action.",
    "location": "Soaltee Hotel, Kathmandu",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-06-05",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "wmccupdates@gmail.com",
    "status": "Closed",
    "cost": "Free",
    "website": "https://khaalisisi.com/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Science Communication",
      "Nature-Based Solutions",
      "Pollution & Waste Management"
    ],
    "address": {
      "street": null,
      "city": "Soaltee Hotel",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/khaalisisi/",
      "instagram": "https://www.instagram.com/khaalisisi/?hl=en",
      "linkedin": "https://np.linkedin.com/company/khaalisisi"
    },
    "id": 6
  },
  {
    "title": "The Himalayan Climate Data Field Lab",
    "organizer": "University of Toronto, HUC, University of Michigan, Government of Nepal, ICIMOD, The World Bank, and more",
    "description": "The Himalayan Climate Data Field Lab brought together 112 participants from 19 countries in Kathmandu during May and June for a month-long, participant-led unconference. The event focused on reimagining how climate change data is created, shared, and used across the Himalayan region. As climate risks intensify, participants explored how data systems influence the understanding and prioritization of climate issues. Organized by Professor Robert Soden and Dr. Austin Lord from the Toronto Climate Observatory, the Field Lab fostered collaboration to develop new tools and approaches for more equitable climate futures.",
    "location": "Kathmandu",
    "locationType": "National",
    "type": "Workshop",
    "format": "In-person",
    "startDate": "2024-05-13",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "huc@icimod.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://urfieldlab.com/ktm2024/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Research & Education",
      "Science Communication",
      "Youth Empowerment"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "hhttps://www.facebook.com/icimod",
      "instagram": "https://www.instagram.com/_icimod/#",
      "linkedin": "https://www.linkedin.com/company/icimod"
    },
    "id": 7
  },
  {
    "title": "Connecting the Dots Between Climate Change, Health, and Equity",
    "organizer": "US National Academy of Medicine (NAM), the National Academy of Science and Technology, Nepal, IAP and other",
    "description": "The workshop provided a platform for dialogue and collaboration, facilitating discussions on innovative approaches and solutions to combat climate-related health risks. Participants expressed optimism about the potential for collective action to drive positive change and enhance resilience in the face of climate change.",
    "location": "Kathmandu",
    "locationType": "National",
    "type": "Workshop",
    "format": "Hybrid",
    "startDate": "2024-03-14",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "iap@twas.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://www.interacademies.org/news/workshop-climate-change-and-health-kathmandu",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate and Mental Health",
      "Social Equity",
      "Community Resilience"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/NAMedicine/",
      "instagram": null,
      "linkedin": null
    },
    "id": 8
  },
  {
    "title": "National Youth Conference on Climate Change",
    "organizer": "Nepalese Youth for Climate Action (NYCA) and Clean Energy Nepal",
    "description": "The National Youth Conference on Climate Change (NYCCC) is the flagship event organized by Nepalese Youth for Climate Action (NYCA), the largest youth-led network of Nepal established in 2008 A.D. to amplify the voices of young people across Nepal in the fight against climate change. The 9th NYCCC was held in Kathmandu from July 26-28, 2024.This conference featured interactive sessions with experts, workshops on climate solutions and policies, and opportunities for networking and cultural exchange, culminating in the creation of a youth declaration paper. Empowering Youth for Climate Justice: Advocacy, Action, and Transformation was the theme of the 9th NYCCC. ",
    "location": "NEA Training Centre, Nagarkot",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-07-26",
    "registrationDeadline": "2024-07-11",
    "registrationLink": null,
    "contactEmail": "nyca.np@gmail.com",
    "status": "Closed",
    "cost": "Free",
    "website": "https://nyca.net.np/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Youth Empowerment",
      "Climate Justice",
      "Climate Activism & Advocacy"
    ],
    "address": {
      "street": null,
      "city": "NEA Training Centre",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/NYCANepal",
      "instagram": "https://www.instagram.com/nyca.nepal/",
      "linkedin": null
    },
    "id": 9
  },
  {
    "title": "The Second Inter-Polar Conference: Connecting the Arctic with the Third Pole-Cryosphere, People, and Climate Change (2025)",
    "organizer": "The conference is  jointly organised by the Arctic Centre of the University of Lapland, ICIMOD, and the Ocean Policy Research Institute (OPRI) in collaboration with the UArctic Chair in Arctic Legal Research and the UArctic Law Thematic Network.",
    "description": "This international conference will take place from 3 20135 September 2025 and will serve as a platform to share the latest scientific knowledge on changes occurring in the cryosphere of the Arctic and Hindu Kush Himalaya (HKH) regions. It will promote collaborative solutions to preserve the cryosphere, contributing to the goals of the International Year of Glaciers' Preservation (IYGP) 2025. The event aims to bring together global experts and knowledge holders to generate actionable insights and develop long-term strategies for climate resilience and environmental sustainability.Eligibility / Requirements Who can apply: Scholars, researchers, and subject-matter experts in climate science, cryosphere studies, and related fields.Submission: Applicants are required to submit research abstracts relevant to the conference theme. Selection Criteria: Abstracts will be evaluated based on quality and thematic relevance. Presentation: Authors of selected abstracts will be invited to present their papers at the conference. Benefits Opportunity to present research at a prestigious international conference.Selected papers will be revised and published in the Italian Polar Journal (IL POLO).Participants will join a lasting network of scholars and stakeholders focused on cryosphere preservation and climate action.Exposure to cutting-edge discussions and collaborative engagement with global experts from the Arctic and HKH regions.",
    "location": "ICIMOD, Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2025-09-03",
    "registrationDeadline": "2025-06-30",
    "registrationLink": null,
    "contactEmail": "interpolarconference2025@gmail.com",
    "status": "Upcoming",
    "cost": "",
    "website": "https://www.icimod.org/announcement/the-second-inter-polar-conference-2025-icimod/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Research & Education",
      "Science Communication",
      "Ecosystem Conservation"
    ],
    "address": {
      "street": null,
      "city": "ICIMOD",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/icimod",
      "instagram": "https://www.instagram.com/_icimod/#",
      "linkedin": "https://www.linkedin.com/company/icimod"
    },
    "id": 10
  },
  {
    "title": "Mountain Advocacy Summit",
    "organizer": "Ministry of Forests and Environment, jointly organized by FAO, DCA, ICIMOD, IUCN, UNDP, UKAid, NTNC, and managed by Karnali Integrated Rural Development and Research Center (KIRDARC Nepal)",
    "description": " The Ministry of Forests and Environment organized the Mountain Advocacy Summit (MAS2022) on 20-21 September 2022 in Jomsom, Mustang. Co-organizers included FAO, DCA, ICIMOD, IUCN, UNDP, UKAid, NTNC, and the event was managed by KIRDARC Nepal. The summit was inaugurated by Honorable Pradeep Yadav, Minister for Forests and Environment, with a virtual address by Rt. Honorable Sher Bahadur Deuba, Prime Minister of Nepal. Honorable Krishna Chandra Nepali Pokharel, Chief Minister of Gandaki Province, attended as special guest.The summit marked the culmination of Nepal's celebration of the International Year of Sustainable Mountain Development (IYM2022). It gathered ministers, government representatives, development partners, CSOs, private sector stakeholders, and local officials to highlight Nepal's mountain agenda. The event concluded with a 28-point declaration addressing six key themes: agriculture, biodiversity, women, culture, climate, and disaster risks.",
    "location": "Jomsom, Mustang",
    "locationType": "National",
    "type": "Summit",
    "format": "Hybrid",
    "startDate": "2022-09-20",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": null,
    "status": "Closed",
    "cost": "",
    "website": "https://www.mofe.gov.np/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate Activism & Advocacy",
      "Ecosystem Conservation",
      "Community Resilience"
    ],
    "address": {
      "street": null,
      "city": "Jomsom",
      "state": "Gandaki",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/moefcc/",
      "instagram": null,
      "linkedin": null
    },
    "id": 11
  },
  {
    "title": "Mountain Nations Ambassadors Conference",
    "organizer": "Ministry of Forests and Environment ",
    "description": "As a part of celebrating IYM2022 in Nepal, the Ministry of Forests and Environment, on behalf of the Government of Nepal, has organized a series of events in collaboration with different partner organizations. Followed by the inauguration of the year-long program by Rt. Honourable Prime Minister Sher Bahadur Deuba, on March 23, and the  'Meet the Members of Parliament' graced by Rt. Honourable Speaker Agni Prasad Sapkota, on July 22, its third major episode was organised as  'Meet the Ambassadors' was held on September 2, 2022, in Kathmandu. This was a consultative meeting, particularly with resident Ambassadors to Nepal, in which resident representatives of UN Agencies and Development Partners in Kathmandu were also invited.The following were the major objectives of this consultative meeting: 1) To communicate Nepal's year-long plan/roadmap of the IYM2022 programs to the participating Ambassadors. 2) To disseminate the issues and agenda of sustainable mountain development that Nepal has been raising in international fora and introduce the Mustang Summit.3) To receive comments from the invitees and participating Ambassadors on Nepal 2019s initiative, and synthesize the feedback on the mountain agenda that needs to be raised in the international arena",
    "location": "Radisson Hotel, Lazimpat, Kathmandu",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2022-09-02",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": null,
    "status": "Closed",
    "cost": "",
    "website": "https://www.mofe.gov.np/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": ["Sustainability", "Environment"],
    "address": {
      "street": null,
      "city": "Radisson Hotel",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/moefcc/",
      "instagram": null,
      "linkedin": null
    },
    "id": 12
  },
  {
    "title": "Earth Hour 2024",
    "organizer": "WWF Nepal",
    "description": "Thousands gathered at Jawalakhel Ground, Kathmandu to celebrate Earth Hour 2024 at the Eco Fiesta organized by WWF Nepal. The fiesta was a celebration of sustainability where local, home-grown sustainable businesses had an opportunity to showcase their products to guests and provide alternative lifestyle options. Paying homage to the indigenous cultures of Kathmandu valley and their innate relationship with nature, the fiesta also had indigenous food stalls and various activities such as pottery, painting, lakhey dance, and more.\n The event even hosted a Sustainable Fashion Show which comprised of incredible designs made of recycled waste materials being showcased by the seven-time winners of Kaleidoscope Inter School Festival. The main message of the fashion show was that  we must learn to reduce our consumerism, and learn to live in harmony with nature. The concluding performance was a Lakhey Dance featuring  Lakhey  and  Pulun Kisi. The Lakhey is known as a protector and the Pulun Kisi is a symbol of good fortune. The dance symbolized the protection of the planet from climate change and expressed the wish for a cleaner, greener planet. The eco-fiesta also had a Knowledge Corner hosted by Sustainability Solutions where guests had the chance to play educational games, participate in a scavenger hunt, and in  201csukkul guff 201d where experts from various fields came to discuss sustainability in their particular fields. Guests also had a chance to join the  201clive painting 201d station, where they could paint their interpretation of the Earth.\n\nAlongside the various activities, the visitors had the opportunity to get to know local vendors such as Dohoran (thrift store), Eco Wares (biodegradable disposable utensils made of sugar cane), Rekriti (a denim upcycling business), Eco Saathi (biodegradable alternatives to everyday products), Raithane (indigenous food products), Sukhawoti (charity thrift store) and many others selling handicrafts, food products and more.\n\nThe event came to an end with a light circle where visitors came together holding candles and stood together forming a  201c60 201d, symbolizing the #biggesthourforearth and the impact of individual actions performed together. \n\nThe event brought together people from all walks of life to celebrate the spirit of sustainability and learn about different ways in each individual can make a difference! Visitors got to spend their #biggesthourforearth by learning about nature and sustainable practices, engaging in art, and engaging in sustainable shopping!",
    "location": "Jawalakhel Ground, Kathmandu",
    "locationType": "National",
    "type": "Side Event",
    "format": "Hybrid",
    "startDate": "2024-03-23",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "http://info@wwfnepal.org/",
    "status": "Closed",
    "cost": "Free",
    "website": "https://www.wwfnepal.org/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Ecosystem Conservation",
      "Wildlife & Biodiversity",
      "Indigenous Knowledge"
    ],
    "address": {
      "street": null,
      "city": "Jawalakhel Ground",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/WWFNepal/",
      "instagram": "https://www.instagram.com/nepalwwf/?hl=en",
      "linkedin": "https://np.linkedin.com/company/wwf-nepal"
    },
    "id": 13
  },
  {
    "title": "International Conference on Mountain Hydrology & Cryosphere 2023",
    "organizer": "The conference was organized by the Nepal committee for the International Association of Hydrological Sciences (IAHS), Kathmandu University (HiCCDRC, KU), and The Small Earth Nepal (SEN). The conference was co-organized by the Department of Hydrology and Meteorology (DHM), Government of Nepal, Society of Hydrologists and Meteorologists (SOHAM), Tribhuvan University (CDHM and CDES, TU), International Centre for Integrated Mountain Development (ICIMOD), International Water Management Institute (IWMI), UNESCO, Nepal Tourism Board (NTB), and Global Water Future (GWF) of the University of Saskatchewan. The other associated partners of the conference are the Nepal Academy of Science and Technology (NAST), Water Resources Research and Development Centre (WRRDC), International Center for Water Resources and Global Change (ICWRGC) and Center of Research for Environment, Energy and Water (CREEW), Nepal.",
    "description": "The International Conference on Mountain Hydrology and Cryosphere was held in Kathmandu and Dhulikhel, Nepal, on 9–10 November 2023. The conference brought together experts to discuss a broad range of topics, including mountain and groundwater hydrology, hydrological and glacio-hydrological modeling, isotope hydrology, and aquatic ecology. Key discussions also addressed water quality, wastewater, transboundary water resource issues, hydro-meteorology in agriculture, and the impacts of climate change on the cryosphere. Sessions covered glacier mass and energy balance, debris-covered and rock glaciers, permafrost hydrology, and water-induced disasters such as GLOFs, LDOFs, avalanches, and landslides.",
    "location": "Dhulikhel, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2023-11-09",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@smallearth.org.np",
    "status": "Closed",
    "cost": "",
    "website": "https://www.iahs-nepal.org/icmhc-2023",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Research & Education",
      "Disaster Risk Management",
      "Science Communication"
    ],
    "address": {
      "street": null,
      "city": "Dhulikhel and Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/TheSmallEarthNepal/",
      "instagram": "https://www.instagram.com/the_small_earth_nepal/",
      "linkedin": "https://np.linkedin.com/company/the-small-earth-nepal"
    },
    "id": 14
  },
  {
    "title": "Post-Intergenerational Dialogue",
    "organizer": "Restless Development and the Social Organization District Coordination Committee Parsa (SODCC Parsa)",
    "description": "In a collaborative effort to bridge generational gaps in addressing climate change, Restless Development and the Social Organization District Coordination Committee Parsa (SODCC Parsa) hosted two Post-Intergenerational Dialogue events in August and September 2024. These dialogues, one held in the urban center of Birgunj and the other in rural Parsa, shared insights from the  201cIntergenerational Dialogue on Responding to Climate Change 201d pilot project, conducted between November 2023 and January 2024 with support from Helpage International, Newcastle University, and Living Deltas.\nBoth dialogues underscored the shared resilience of urban and rural communities in confronting climate change. The discussions emphasized the importance of local adaptation strategies, infrastructure upgrades, and community-level awareness. As the impacts of climate change continue to intensify, we must capitalize on the momentum generated by these dialogues and take decisive action to build a more sustainable and resilient future for all.",
    "location": "one held in the urban center of Birgunj and the other in rural Parsa",
    "locationType": "National",
    "type": "Workshop",
    "format": "In-person",
    "startDate": "2024-08-28",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@restlessdevelopment.org",
    "status": "Closed",
    "cost": "Free",
    "website": "https://restlessdevelopment.org/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Youth Empowerment",
      "Climate Activism & Advocacy",
      "Indigenous Knowledge"
    ],
    "address": {
      "street": null,
      "city": "one held in the urban center of Birgunj and the other in rural Parsa",
      "state": "Madhesh",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "http://facebook.com/RestlessDevelopmentNepal/",
      "instagram": "https://www.instagram.com/restlessdevelopmentnepal/?hl=en",
      "linkedin": "https://np.linkedin.com/company/restless-development-nepal"
    },
    "id": 15
  },
  {
    "title": "Balbalika tatha Yuva Sambaad (BaYu Sambaad)",
    "organizer": "organized by the Government of Nepal, United Nations Nepal (UNICEF Nepal, FAO Nepal, UNDP Nepal), Nepalese Youth for Climate Action (NYCA), Mountain Youth Hub (MYH), World Food Forum (WFF) Nepal, Global Youth Biodiversity Network (GYBN) Nepal, and Clean Energy Nepal (CEN).",
    "description": "More than 100 children and young people from across Nepal convened in Kathmandu for the Balbalika tatha Yuwa (BaYu) Sambaad, a children- and youth-led national dialogue on climate action ahead of the international Sagarmatha Sambaad.The BaYu Sambaad featured an exhibition of child- and youth-led climate solutions, video show, expert sessions on climate resilience, and two intergenerational panel discussions. The first explored the impact of climate change on essential services like education, health, and water. The second aligned with the themes of the Sagarmatha Sambaad  scheduled from 16 to 18 May highlighting the connections between climate change, mountain ecosystems, and the future of humanity. The Sambaad also included testimonies of children, adolescents, and youths from across Nepal.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2025-04-26",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": null,
    "status": "Closed",
    "cost": "Free",
    "website": "https://nepal.un.org/en",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": ["Youth Empowerment", "Research & Education", "Social Equity"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/UnitedNationsNepal/",
      "instagram": "https://www.instagram.com/unitednations_nepal/?hl=en",
      "linkedin": "https://np.linkedin.com/company/un-nepal"
    },
    "id": 16
  },
  {
    "title": "Pre-COP Event: Preparing Nepalese Young People for COP29 and NDC 3.0",
    "organizer": "Clean Energy Nepal, the Nepalese Youth for Climate Action (NYCA), Kathmandu Metropolitan City, UNICEF, World's Youth for Climate Justice, and YASEN",
    "description": "In preparation for COP29 in Baku, Azerbaijan, a full-day Pre-COP event titled \"Preparing Nepalese Young People for COP29 and NDC 3.0 \" was held at Square Hotel, Lalitpur. The program brought together young climate activists, environmental experts, and representatives from key organizations to strengthen youth engagement in climate negotiations. Organized by Clean Energy Nepal, Nepalese Youth for Climate Action (NYCA), Kathmandu Metropolitan City, UNICEF, World’s Youth for Climate Justice, and YASEN, the event featured sessions on Nepal’s updated NDC 3.0, the mechanisms of the Paris Agreement, and youth roles in climate policy. Participants engaged in interactive workshops and discussions on COP29 priorities and strategic climate action. Speakers highlighted the importance of youth voices in shaping a resilient, low-carbon future and emphasized building their capacity to influence both national and international climate agendas.",
    "location": "Square Hotel, Lalitpur",
    "locationType": "National",
    "type": "Workshop",
    "format": "Hybrid",
    "startDate": "2024-10-28",
    "registrationDeadline": null,
    "registrationLink": null,
    "contactEmail": "info@cen.org.np",
    "status": "Closed",
    "cost": "Free",
    "website": "https://www.cen.org.np/",
    "bannerImageId": null,
    "bannerImageUrl": "",
    "category": [
      "Climate Justice",
      "Youth Empowerment",
      "Climate Activism & Advocacy"
    ],
    "address": {
      "street": null,
      "city": "Square Hotel",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/CENepal",
      "instagram": "https://www.instagram.com/cenepal/",
      "linkedin": "https://np.linkedin.com/company/cenepal"
    },
    "id": 17
  },
  {
    "title": "COP In My City 2024",
    "organizer": "CliMates Nepal",
    "description": "\"COP in My City Nepal\" is a flagship event of CliMates Nepal. This year CliMates Nepal is organizing \"COP in My City Nepal 2024\" with the support of Open Dialogue on Climate Change (ODCC). This event is designed to empower and engage the youth of Nepal through an immersive and comprehensive understanding of the United Nations Framework Convention on Climate Change (UNFCCC) Conference of the Parties (COP) mechanism. This dynamic three-day event will serve as a platform for young leaders, climate enthusiasts, and experts to come together and delve into the intricacies of international climate negotiations, policy-making processes, and climate action strategies. <br> The primary objective of \"COP in My City Nepal 2024\" is to bridge the gap between global climate policies and local realities. By simulating real-world climate negotiations, the event aims to equip participants with the skills and knowledge needed to actively participate in and influence climate policy discussions. Participants will engage in hands-on climate negotiation simulations that mirror the procedures of the actual UNFCCC COP, enabling them to experience the complexities and challenges of global climate governance. <br> In addition to the negotiation simulations, the event will feature a series of policy consultations that focus on the unique challenges and opportunities presented by Nepal's diverse landscapes and climate vulnerabilities. These consultations will bring together a diverse group of stakeholders, including government representatives, climate experts, local community leaders, and youth activists, to discuss and strategize on actionable solutions for climate change mitigation and adaptation. <br> Register: https://docs.google.com/forms/d/e/1FAIpQLSeMQIMeORm-hWqESUGOlgVjDI-LMF-bv9DA3vzhgXbE-fvRhA/viewform",
    "location": "Chitwan, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-10-04",
    "registrationDeadline": null,
    "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeMQIMeORm-hWqESUGOlgVjDI-LMF-bv9DA3vzhgXbE-fvRhA/viewform",
    "contactEmail": "climatesnepal20@gmail.com",
    "status": "Closed",
    "cost": "Free",
    "website": null,
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/gvCd6f4/cop-in-my-city-2024-logo.jpg",
    "category": [
      "Climate Activism & Advocacy",
      "Youth Empowerment",
      "Climate Justice"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/CliMatesNepal",
      "linkedin": "https://www.linkedin.com/company/climates-nepal",
      "instagram": "https://www.instagram.com/climates_nepal/"
    },
    "id": 18
  },
  {
    "title": "National Conference on Climate Change and Health",
    "organizer": "Ministry of Health and Population",
    "description": "The National Conference on Climate Change and Health was held on 1–2 August 2024 at Hotel Himalaya, Lalitpur, organized by the Ministry of Health and Population and WHO Nepal. The event highlighted Nepal’s efforts to build a climate-resilient, low-carbon health system, aligning with its commitments under COP26 and the COP28 Declaration on Climate and Health. Experts and stakeholders shared evidence, experiences, and strategies to address the health impacts of climate change.",
    "location": "Lalitpur, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2025-08-01",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "info@mohp.gov.np",
    "status": "Closed",
    "cost": "Free",
    "website": "https://nhrc.gov.np/projects/national-conference-on-climate-change-and-health/",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/1Gmf5kp/climate-change-health-conf-logo.jpg",
    "category": [
      "Climate and Mental Health",
      "Pollution & Waste Management",
      "Community Resilience"
    ],
    "address": {
      "street": null,
      "city": "Lalitpur",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/mohpnep/",
      "linkedin": "",
      "instagram": ""
    },
    "id": 19
  },
  {
    "title": "Local Conference of Youth (LCOY) 2024",
    "organizer": "YASEN & SWK",
    "description": "LCOY is an event initiated by YOUNGO, with an aim to empower youth through networking and knowledge sharing. d83c df10 LCOY serves as a significant platform for young people to engage with the UNFCCC process and meaningfully contribute to climate discussions. d83c df0d d83d dcad <br> LCOY Nepal 2024 is an annual gathering of Nepalese youth, who are passionate about climate change and environmental topics. d83c ddf3 d83c ddf5 LCOY Nepal 2024 desires to connect the annual climate negotiations to local climate action and turn words into actions, especially youth actions 203c fe0f <br>   Themes of LCOY 2024   <br>   Building Capacity, Connecting Communities   - Strengthening skills and networks to drive collective action for a healthier, more resilient future. <br>   Children & Youth Engagement in Nationally Determined Contributions   - Amplifying youth voices and actions to drive ambitious climate commitments at the national level. <br>   Addressing Climate Loss & Damage   - Taking action to mitigate and adapt to the impacts of climate change on vulnerable communities. <br>   Indigenous Wisdom, Climate Resilience   - Harnessing traditional knowledge for sustainable solutions to climate challenges.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2025-08-03",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "lcoynepal2024@gmail.com",
    "status": "Closed",
    "cost": "Paid",
    "website": "",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/TwthnwH/lcoy-Nepal2024logo.jpg",
    "category": [
      "Climate Action",
      "Climate Activism & Advocacy",
      "Youth Empowerment"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/lcoynepal2024/",
      "linkedin": "https://www.instagram.com/lcoynepal2024/",
      "instagram": "https://www.linkedin.com/in/lcoy-nepal-95b481306/"
    },
    "id": 20
  },
  {
    "title": "9th National Youth Conference on Climate Change (NYCCC)",
    "organizer": "Nepalese Youth for Climate Action",
    "description": "The National Youth Conference on Climate Change (NYCCC) is the flagship event organized by Nepalese Youth for Climate Action (NYCA) to amplify the voices of young people across Nepal in the fight against climate change. <br> The 9th NYCCC will be held in Kathmandu from July 26-28, 2024, and is open to passionate young individuals aged 18-29 from all regions of Nepal. <br> This conference will feature interactive sessions with experts, workshops on climate solutions and policies, and opportunities for networking and cultural exchange, culminating in the creation of a youth declaration paper. <br> Don't miss this chance to be a part of an unforgettable Youth festival with the theme  201cEmpowering Youth for Climate Justice: Advocacy, Action, and Transformation. 201d",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "",
    "format": "In-person",
    "startDate": null,
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "nyca.np@gmail.com",
    "status": "Closed",
    "cost": "",
    "website": "https://nyca.net.np/ ",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/j3WDYkr/nyca-conference-2024-logo.jpg",
    "category": [
      "Youth",
      "Climate Conference",
      "Capacity Building",
      "Climate Action"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/NYCANepal",
      "linkedin": "https://np.linkedin.com/company/nyca-nepal",
      "instagram": "https://www.instagram.com/nyca.nepal/"
    },
    "id": 21
  },
  {
    "title": "FIG Regional Conference 2024",
    "organizer": "Nepal Institution of Chartered Surveyors and International Federation of Surveyors",
    "description": "The main objective of the event is to build knowledge and capacity in the Asian region to address climate change and disaster-induced challenges in safeguarding land rights of vulnerable communities, emphasizing the critical role of land governance and disaster resilience. <br> The second objective is to foster collaborative partnerships among national and regional institutions, academics, and professionals from various organisations, including non-state actors, Non-Government Organisation (NGOs) and private sector, to facilitate multistakeholder dialogues, knowledge sharing and technology transfer at the regional level. <br> NICS and FIG aim to promote the important role of surveying professions and surveyors in translating sustainable development goals into action and enhancing community resilience to climate change. <br> The overall theme is Climate Responsive Land Governance  and Disaster Resilience: Safeguarding Land Rights. <br> Date: 14-16 November 2024, Hotel Yak and Yeti, Kathmandu, Nepal",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": null,
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "gpbhatta@gmail.com",
    "status": "Closed",
    "cost": "",
    "website": "https://www.fig.net/nepal2024/index.htm",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/ZfPWKhB/fig-2024-logo.jpg",
    "category": [
      "Research & Education",
      "Science Communication",
      "Disaster Risk Management"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/internationalfederationofsurveyors/",
      "linkedin": "https://www.linkedin.com/company/fig---international-federation-of-surveyors",
      "instagram": ""
    },
    "id": 22
  },
  {
    "title": "International Conference on Environment and Life Science (ICELS - 24)",
    "organizer": "ISFECC",
    "description": "International Conference on Environment and Life Science (ICELS - 24) at Kathmandu, Nepal, on 18th Dec - 19th Dec'2024 is delighted to welcome professionals, academicians, and practitioners from the field to attend high-level conferences. The IIERD is organising meaningful discussions focusing on solutions, future scope, and ongoing trends. This is your chance to acquire knowledge, learn, and improve. <br> As a participant, this is your golden opportunity to create valuable connections through socialisation which will boost your professional journey. This event will welcome experts from national and international locations connected to the field. So, meet your heroes and engage in revolutionary discussions. <br> Moreover, you can engage with like-minded people and explore new areas of interest with active participation. Moreover, academicians can present their research, vision, and creative ideas to benefit the topic. The atmosphere of active questioning and engagement will benefit the event and all participants. <br> Attendance at these conferences will level up your CV and prove helpful in future endeavours. Moreover, it will give an insight into where all the nations stand concerning advancements and recent trends in Environment and Life Science . An event full of socialisation, opportunities, information, and specialists should not be missed. <br> You can discuss your career, fields, and research and get an evaluation from participants and speakers. They will assist you in choosing the right path. Moreover, conferences organised at amazing locations help you explore several cities. <br> At the IIERD conference, you can meet leading business delegates & sponsors who are looking for creative minds. Moreover, you can grab the opportunity to get funded for your further studies at Environment and Life Science.",
    "location": "KUala Kumpur, Malaysia",
    "locationType": "International",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-01-21",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "info@iierd.org",
    "status": "Closed",
    "cost": "Paid",
    "website": "https://www.iierd.org/events/index.php?id=2531408",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/nLHbr9R/ICELS-2024-logo.png",
    "category": ["Environment", "Research & Education", "Sustainability"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "",
      "linkedin": "",
      "instagram": ""
    },
    "id": 23
  },
  {
    "title": "The Annual Kathmandu Conference on Nepal & the Himalaya 2024",
    "organizer": "Social Science Baha",
    "description": "The Annual Kathmandu Conference on Nepal and the Himalaya has been hosted by Social Science Baha since 2012 in collaboration with the Association for Nepal and Himalayan Studies, Britain 2013Nepal Academic Council, the Centre for Himalayan Studies 2013CNRS (since 2015) & Nepal Academic Network (Japan) (since 2016). <br> The objective of the conference is to provide a scholarly platform in Kathmandu to scholars working on various aspects of social life in Nepal and the Himalaya from the perspective of social science as well as the arts and the humanities.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-07-24",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "info@soscbaha.org",
    "status": "Closed",
    "cost": "",
    "website": "https://annualconference.soscbaha.org/",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/JBRLHxf/social-science-baha-logo.png",
    "category": ["Research & Education", "Youth Empowerment"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/soscbaha",
      "linkedin": "https://www.linkedin.com/company/socialsciencebaha/",
      "instagram": ""
    },
    "id": 24
  },
  {
    "title": "Mechi to Mahakali: Stories & Experiences on Climate Change",
    "organizer": "NICC",
    "description": "Happy Environment Day 2024! Let's reflect on the vulnerability of our planet and honor the relentless struggle of grassroots activists. Join us on June 6, 2024, for an inspiring experience-sharing session with the activist who walked Mechi Mahakali with the goal of raising nationwide awareness on environmental conservation and the urgent need to address pressing issues like global warming and climate change.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "March",
    "format": "In-person",
    "startDate": "2024-04-05",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "nepal.climate.coalition@gmail.com",
    "status": "Closed",
    "cost": "Free",
    "website": "",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/8bSFjHt/mechi-to-mahakali-2024-logo.png",
    "category": ["Environment", "Climate Action", "Sustainability"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/Nepal.NICC",
      "linkedin": "",
      "instagram": "https://www.instagram.com/nicc.nepal/p/C70srTLqh0m/?locale=en"
    },
    "id": 25
  },
  {
    "title": "Youth and Climate Symposium 2024",
    "organizer": "British Council Nepal",
    "description": "Youth and Climate 2024 (4 June to 10 June) unites stakeholders from diverse backgrounds to explore creative green economy and youth leadership in climate action. Through a series of activities, the participants engage in conversations to discuss climate change related challenges and opportunities. <br> The programme provides a platform to share how youth  2013 through innovation, advocacy, and action  2013 can respond to the climate emergency. In collaboration with a consortium of UK and Nepal partners, we are organising a one-day symposium on creative green economy and climate action, a week-long exhibition that showcases creative green projects, an interactive talk programme on material culture workshops and masterclasses for students and creative professionals. <br> The activities bring together thought leaders, artists, activists, community members, academicians, educators, and youth innovators to explore creativity, entrepreneurship, and environmental sustainability contributing to a greener future.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Symposium",
    "format": "In-person",
    "startDate": "2024-06-05",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "general.enquiry@britishcouncil.org.np",
    "status": "Closed",
    "cost": "Free",
    "website": "https://www.britishcouncil.org.np/youth-and-climate-2024",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/HFbwj7w/youth-and-climate-2024-logo.png",
    "category": [
      "Climate Activism & Advocacy",
      "Youth Empowerment",
      "Research & Education"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://fb.watch/tjfyYV_8-p/",
      "linkedin": "",
      "instagram": "https://www.instagram.com/npbritish/?hl=en"
    },
    "id": 26
  },
  {
    "title": "Waste Management and Climate Conference (WMCC) 2024",
    "organizer": "Khaalisisi",
    "description": "WMCC 2024 is jointly organized by the Ministry of Forests and Environment (MOFE), the Confederation of Nepalese Industries (CNI), the Coca-Cola Foundation, Khaalisisi, the National Human Rights Commission, the Confederation of Nepalese Industries Young Entrepreneurs Forum (CNIYEF), and Women for Human Rights (WHR). <br> This significant event will address pressing environmental challenges through collective action and policy initiatives. <br> Call For Participation: We are excited to announce that #Khaalisisi together with #CNI, #NationalHumanRightsCommission, #CocaColaFoundation, #CNIYEF and #WHR is jointly organizing #WMCC 2024 - Waste Management & Climate Conference on June 05 in observance of the #WorldEnvironmentDay. As we tackle pressing global challenges like waste management, air pollution, melting ice caps, and more, we need your collaboration, support, and expertise.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "",
    "format": "In-person",
    "startDate": null,
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "wmccupdates@gmail.com",
    "status": "Closed",
    "cost": "",
    "website": "",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/HBbwz6r/wmcc-logo.jpg",
    "category": ["Climate Conference", "Waste Management", "Environment"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/khaalisisi/posts/-call-for-participation-we-are-excited-to-announce-that-khaalisisi-together-with/741864951492961/",
      "linkedin": "",
      "instagram": ""
    },
    "id": 27
  },
  {
    "title": "Earth Hour Nepal 2024",
    "organizer": "WWF Nepal",
    "description": "Thousands gathered at Jawalakhel Ground, Kathmandu, to celebrate Earth Hour 2024 at the Eco Fiesta organized by WWF Nepal. The event showcased local sustainable businesses, indigenous food stalls, and cultural activities such as pottery, painting, and Lakhey dance. A highlight was the Sustainable Fashion Show, featuring designs made from recycled materials by Kaleidoscope Inter School Festival winners, promoting the message of reducing consumerism and living in harmony with nature. The Knowledge Corner, hosted by Sustainability Solutions, offered educational games, expert talks, a scavenger hunt, and live painting. Visitors also explored stalls from vendors like Dohoran, Eco Wares, Rekriti, Eco Saathi, Raithane, and Sukhawoti. The celebration concluded with a symbolic light circle where attendees held candles to form a “60,” representing the #biggesthourforearth and the power of collective action for the planet.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Event",
    "format": "In-person",
    "startDate": null,
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "",
    "status": "Closed",
    "cost": "Free",
    "website": "https://www.wwfnepal.org/?384435/WWF-Nepal-celebrates-Earth-Hour-2024-with-an-Eco-Fiesta",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/9hgVpJc/earth-hour-logo.jpg",
    "category": ["Environment", "Sustainability", "Youth Empowerment"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/events/840393051187758/?ref_source=NEWS_FEED&paipv=0&eav=AfZy-YspNm_MeTM2LTTI-YixKMOx9of0QlkPg1yybUIpiURkOwspfDV1_OvE3rKf5bg&_rdr",
      "linkedin": "",
      "instagram": ""
    },
    "id": 28
  },
  {
    "title": "Peoples Climate March to End Fossil Fuels Kathmandu 2023",
    "organizer": "People's Climate Mobilisation - Nepal",
    "description": "While over 700 mobilisations against fossil fuels are planned around the world from September 15 to 17 to draw the attention of stakeholders, more than 500 people took to the streets today in the nine major cities of Nepal demanding rapid, just and equitable eradication of fossil fuels. The climate march was organised in Gauradha, Jhapa, Biratnagar and Udayapur of Koshi Province and Hetauda, Kathmandu, Lalitpur and Sindhuli of Bagmati Province. It was also followed in Pokhara and Lamjung of Gandaki Province and Bhairahawa of Lumbini Province. <br> Organiser of People's Climate March 2023, Sagar Koirala said, \"As world leaders gather at the United Nations Climate Ambition Summit on September 17, we want to raise millions of voices to pressurise stakeholders to stop the use of fossil fuel and focus on use of renewable energy sources.\" <br> \"Today, we joined hands in Patan of Lalitpur to demand swift, just, and equitable end to fossil fuels,\" he said, adding, \"It's time to make a change for our planet's future. We have to end fossil fuels and quickly make transition towards renewable energy.\" Climate advocates across different cities of Nepal have urged world leaders to undertake a rapid, equitable and just fossil fuel phase-out to protect the people and planet, said Omkar Subedi, an activist from People's Climate Mobilisation Team. He further said, \"With so many deceptive excuses, governments are expanding rather than phasing out gas and oil. Unreliable solutions like carbon capture and removal technologies, and hydrogen and ammonia co-firing are being promoted to extend the life of coal energy. <br> Source - thehimalayantimes",
    "location": "Lalitpur, Nepal",
    "locationType": "National",
    "type": "",
    "format": "In-person",
    "startDate": null,
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "",
    "status": "Closed",
    "cost": "",
    "website": "https://peoplesclimatemobilisation.blogspot.com/",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/7nzgSjk/people-climate-march-logo.png",
    "category": ["Youth", "Climate Rally", "Climate Action", "Environment"],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/PCMktmUpdates/",
      "linkedin": "",
      "instagram": ""
    },
    "id": 29
  },
  {
    "title": "LoF National Conference 2023",
    "organizer": "Land Our Future",
    "description": "Land Our Future organized its first National Conference at College of Business Management, Dillibazar Kathmandu on December 23-24, 2024. The national conference was participated in by more than 100 youths representing various fields. Miss Nepal 2023 Srichchha Pradhan attended both the inaugural session and panel discussion during the two day conference as special guest. The LOF Conference themed  Youth stands with Nature is a dynamic conference designed to unite individuals from various sectors who are actively engaged in Environment Protection, Climate Action, Forest & Biodiversity Agriculture & Soil Management, and Sustainable Development Goals. The conference featured round table discussion, poster presentation, special training session on UN Environment agenda on COP 28, Key Note Speakes remarked on thematic subjects and cultural activities as well. On the closing ceremony all the participates were handed over certificates. The conference aimed to foster collaboration, knowledge-sharing, and innovative thinking among environment & climate activists, researchers, scholars, government representatives, school and university students, according to the organizers. By incorporating various interactive modules, including presentations, storytelling, video play, and group work, the event is aimed at empowering participants to enhance their understanding of environmental crisis protection and develop effective strategies for addressing them. <br> source: thenepalweekly",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2023-12-23",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "",
    "status": "Closed",
    "cost": "",
    "website": "",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/3NJbdZX/land-our-future-logo.png",
    "category": [
      "Ecosystem Conservation",
      "Wildlife & Biodiversity",
      "Sustainability"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/LandourFuture",
      "linkedin": "https://www.instagram.com/land_our_future/",
      "instagram": "https://www.linkedin.com/company/land-our-future/"
    },
    "id": 30
  },
  {
    "title": "Local Conference of Youth (LCOY) 2023",
    "organizer": "PowerShift Nepal",
    "description": "LCOY NEPAL aims to bring together the vision and ideas of young and enthusiastic Nepali youth from the grassroots level and flourish them into action through a joint effort. And, finally, layout objectives will be taken to COP28 through the active involvement of Nepali youths from diverse fields. <br> The two-day event will serve as a platform for in-depth discussions on climate change, its impacts, underlying causes, and the various initiatives undertaken by humanity in response. LCOY focuses on key themes including Climate Justice and Equity, Youth Empowerment, Community Engagement, Climate Finance, and Governance. The event will feature group presentations and panel discussions on these critical topics, offering attendees a comprehensive understanding of climate-related issues and solutions. All the attendees of the programme will be provided with certificates. <br> LCOY NEPAL 2023 has collaborated with an esteemed lead organiser, POWERSHIFT NEPAL, and co-organisers Sustainability Week Kathmandu, Thought for Food, Harin Nepal, International Forestry Students 2019 Association (IFSA), Female Foresters Nepal (FFN), Youth Action For Sustainable And Eco Nepal (YASEN), Climates Nepal, Pravaha Collective, and Eco-Network.",
    "location": "Kathmandu, Nepal",
    "locationType": "National",
    "type": "Conference",
    "format": "In-person",
    "startDate": "2024-09-15",
    "registrationDeadline": null,
    "registrationLink": "",
    "contactEmail": "lcoynepal2024@gmail.com",
    "status": "Closed",
    "cost": "Paid",
    "website": "",
    "bannerImageId": null,
    "bannerImageUrl": "https://i.ibb.co/Vp3RwT0/lcoy-logo-2023.jpg",
    "category": [
      "Climate Activism & Advocacy",
      "Youth Empowerment",
      "Climate Justice"
    ],
    "address": {
      "street": null,
      "city": "Kathmandu",
      "state": "Bagmati",
      "zip": null,
      "country": "Nepal"
    },
    "socials": {
      "facebook": "https://www.facebook.com/lcoynepal2024",
      "linkedin": "https://www.instagram.com/lcoynepal2024/",
      "instagram": "https://www.linkedin.com/in/lcoy-nepal-95b481306/"
    },
    "id": 31
  }
]
